=begin
 Заданы три числа, которые обозначают число, месяц, год (запрашиваем у пользователя). 
 Найти порядковый номер даты, начиная отсчет с начала года. Учесть, что год может быть високосным
=end

print "Введите дату рождения в формате dd.mm.yyyy = "
date = gets.chomp.split(".")
day = date[0].to_i
month = date[1]
year = date[2].to_i

months = {
	"01" => 31,
	"02" => 28,
	"03" => 31,
	"04" => 30,
	"05" => 31,
	"06" => 30,
	"07" => 31,
	"08" => 31,
	"09" => 30,
	"10" => 31,
	"11" => 30,
	"12" => 31
}

=begin
в этом году остался только декабрь, если человек родился в 
декабре, то год не високосный, если же в любом другом то его 
др в след году и год високосный
=end 

visokosn = true
visokosn = false if month == "12" && day >= Time.new.mday

months["02"] = 29 if visokosn

number = day

if day > months[month] || year > 2015 
	puts "такая дата не существует"
else
	months.each do |m,d|
		number += d if m.to_i < month.to_i
	end
end

puts "#{number} является порядковым номером вашей даты рождения с начала года"